# 1)

# Python-ში loop გამოიყენება გარკვეული კოდების ერთობლიობის(კუბის) განმეორებით შესასრულებლად სანამ მოცემული პირობა არ შესრულდება.

# 2)

# range (ანუ დიაპაზონი) ფუნქცია გამოიყენება ციკლში, იტერაციების რაოდენობის მისათითებლად და სამართავად. range ფუნქციას შეგვიძლია გადავცეთ სამი სახის არგუმენტი: start, stop და step. start
#მიუთითებს საწყისი რიცხვის მნიშვნელობას (Default მნიშვნელობა არის 0). stop-ში მივუთითებთ რიცხვს სადამდეც გაგრძელდება იტერაცია. step-ით მივუთითებს იმ რიცხვს რა შუალედებითაც იქნება 
#თითოეული იტერაცია ერთმანეთისგან დაშორებული/განსხვავებული.

# 3)

# for i in range(100, 201):
#     print(i)

# 4)

# for i in range(20, 30, 3):
#     print(i)

# 5)

# for i in range(0, 21, 2):
#     print(i)

# 6)

for i in range(5):
    num1 = int(input())
    num2 = int(input())
    num3 = int(input())
    num4 = int(input())
    num5 = int(input())
    arithmetic = num1 + num2 + num3 + num4 + num5
    print(arithmetic / 5)