#კომენტარი არის ტექსტი რომელსაც კომპიუტერი არ აღიქვამს კოდის ნაწილად
#case-sensitive ნიშნავს რომ კონკრეტულ პროგრამისტულ ენაში დიდი და პატარა ასოების მნიშვნელობა განსხვავდება. მაგალითად: "Hello" და "hello" განსხვავებული მნიშვნელობებისაა.
#snake_case არის ერთერთი გზა რათა ფრაზები დავწეროთ space-ის გამოყენების გარეშე, ეს ხდება დაშორების ქვედა ტირე-თი ჩანაცვლებით. მაგალითად: grocery_list, cake_ingredients, bicycle_lessons.
#debugging არის პროცესი რომელშიც ვპოულობთ და ვასწორებთ კოდში შეცდომებს.

print("Hello World")
city = "London"
print(city)