# 1)
# / არის ჩვეულებრივი გაყოფის ოპერატორი და მისი პასუხი არის float. // განაყოფს ამრგვალებს უახლოეს მთელ integer-ამდე. % გვაძლევს გაყოფის შემდეგ მიღებულ ნაშთს.

# / მაგალითები:
# print(10 / 3)
# print(10 / 5)
# print(25 / 5)

# // მაგალითები:
# print(10 // 3)
# print(10 // 5)
# print(30 // 12)

# % მაგალითები:
# print(10 % 3)
# print(10 % 2)
# print(25 % 4)

# 2)
# elif საშუალებას გვაძლევს გადავამოწმოთ დამატებითი პირობები თუ წინა პირობები (if/elif) არ შესრულდა.

# 3)

year = int(input())
if year % 4 == 0 and year % 100 == 0:
    print(year, "aris nakiani")
elif year % 400:
    print(year, "ar aris nakiani")
