# 2)

#sequencing არის პროცესი როდესაც კომპიუტერი კოდს ასრულებს თანმიმდევრობით (ზევიდან ქვემოთ).

# print(1)
# print(2)
# print(3)

#iteration არის მითითების განხორციელება განმეორებით. მაგალითად მუსიკის განმეორებით რეჟიმზე ჩართვა.
#selection არის პროცესი როდესაც კომპიუტერი რაღაც პირობაზე დაყრდნობით აკეთებს არჩევანს. მაგალითად საათები აცნობებენ მფლობელს, თუ მათი გულისცემა ნორმალურ დიაპაზონს სცდება.

# 3)

#algorithm არის გარკვეული თანმიმდევრობით მოცემული ზუსტი მითითებები რაიმე დავალების შესასრულებლად. მაგალითად ეტაპობრივი ინსტრუქციები რაიმე კერძის რეცეპტში.

# 4)

#ალგორითმებს ვხსნით სამი გზით pseudocode, natural code და flowcharts. flowchart გვეხმარება ალგორითმის ვიზუალიზაციაში. pseudocode არის გამარტივებული ენა რომელიც შედარებით უფრო ახლოსაა პროგრამირების ენასთან. natural language დამწყებებისთვის საუკეთესო არჩევანია რადგან არის ყველაზე პირდაპირი და გასაგები დანარჩენებთან შედარებით.

# 5)

# name = input()
# my_name = "Dato"
# print(bool(name == my_name))

#natural language-ით ახსნა: პროგრამა ამოწმებს არის თუ არა მომხმარებლის მიერ მითითებული სახელი "Dato". თუ არის დაბეჭდავს True-ს, თუ არარის დაბეჭდავს False-ს